package com.example.chayan.quesgame;

public class Questions {

    public String mQuestions[]={

            "১) বাংলাদেশের স্বাধীনতা সংগ্রামের সর্বাধিনায়ক কাকে বলা হয় ?",
            "২) শেখ মুজিবকে 'বঙ্গবন্ধু' উপাধি কে দেন?",
            "৩) কোথায় 'বঙ্গবন্ধু উপাধি দেওয়া হয়?",
            "৪) শেখ মুজিবকে 'বঙ্গবন্ধু' উপাধি দেয়া হয় কবে?",
            "৫) ছয়দফা ১ম কবে ঘোষনা করেন?",
            "৬) বিরোধীদলের সম্মেলনে মুজিব কবে ছয়দফা উথ্থাপন করেন?",
            "৭) শেখ মুজিব আনুষ্ঠানিকভাবে কবে ছয়দফা ঘোষনা করেন?",
            "৮) কোন প্রস্তাবের ভিত্তিতে ছয়দফা রচিত হয়?",
            "৯) ঐতিহাসিক 'ছয়দফা' কে ষোষনা করেন?",
            "১০)'বাঙ্গালী জাতির মুক্তির সনদ' হিসেবে পরিচিত কোনটি?",
            "১১)পূর্ব পাকিস্থানের নামকরণ \"বাংলাদেশ\" করা হয় কবে?",
            "১২) কে বাংলাদেশ নামকরন করেন?",
            "১৩) শেখ মুজিবুর রহমানকে 'জাতির জনক' ঘোষনা করা হয় কবে?",
            "১৪) কে শেখ মুজিবকে জাতির জনক ঘোষনা করেন?",
            "১৫) শেখ মুজিব কে জাতির জনক ঘোষনা করা হয় কোথায়?",
            "১৬) আগরতলা ষড়যন্ত্র মামলা দায়ের করা হয় কবে?",
            "১৭) আগরতলা মামলার মোট আসামী কতজন ছিল?",
            "১৮) আগরতলা ষড়যন্ত্র মামলার প্রধান আসামী কে ছিল?"

    };

    private String mChoices[][]={

            {"বঙ্গবন্ধ শেখ মুজিবুর রহমান","আ.স.ম. আব্দুর রব","তাজউদ্দিন আহমদ","সৈয়দ নজরুল"},
            {"ৈয়দ নজরুল","none","তোফায়েল আহম্মেদ","ওবায়দুল কাদের"},
            {"রেসকোর্স ময়দানে","লাহোর","আগরতলা","মুজিবনগর"},
            {"২0 ফেব্রুয়ারী ১৯৬৯ সালে","২1 ফেব্রুয়ারী ১৯৬৯ সালে","২৩ ফেব্রুয়ারী ১৯৬৯ সালে","২8 ফেব্রুয়ারী ১৯৬৯ সালে"},
            {"8 ফেব্রুয়ারী ১৯৬৬","৫ ফেব্রুয়ারী ১৯৬৬","২ ফেব্রুয়ারী ১৯৬৬","২ ফেব্রুয়ারী ১৯৬৬"},
            {"৩ ফেব্রুয়ারী ১৯৬৬","১৩ ফেব্রুয়ারী ১৯৬৬","১8 ফেব্রুয়ারী ১৯৬৬","২0 ফেব্রুয়ারী ১৯৬৬"},
            {"২0 মার্চ ১৯৬৬","২১ মার্চ ১৯৬৬","২২ মার্চ ১৯৬৬","২৩ মার্চ ১৯৬৬"},
            {"লাহোর প্রস্তাব","আগরতলা","রেসকোর্স","none"},
            {"সৈয়দ নজরুল","তাজউদ্দিন আহমদ","আ.স.ম. আব্দুর রব","শেখ মুজিবুর রহমান"},
            {"ছয়দফা","একুশ দফা","৫ দফা","৭ দফা"},
             {"8 ডিসেম্বর ১৯৬৯ সালে","৫ ডিসেম্বর ১৯৬৯ সালে","৬ ডিসেম্বর ১৯৬৯ সালে","৭ ডিসেম্বর ১৯৬৯ সালে"},
            {"শেখ মুজিবুর রহমান","তাজউদ্দিন আহমদ","আ.স.ম. আব্দুর রব","তোফায়েল আহম্মেদ"},
             {"2 মার্চ ১৯৭১","৩ মার্চ ১৯৭১","8 মার্চ ১৯৭১","৫ মার্চ ১৯৭১"},
            {"আ.স.ম. আব্দুর রব","তোফায়েল আহম্মেদ","তাজউদ্দিন আহমদ","সৈয়দ নজরুল"},
            {"মুজিবনগর","আগরতলা","পল্টন ময়দানে","সরেসকোর্স ময়দানে"},
            {"১ জানুয়ারী ১৯৬৮","2 জানুয়ারী ১৯৬৮","৩ জানুয়ারী ১৯৬৮","8 জানুয়ারী ১৯৬৮"},
            {"৩৩ জন (শেখ মুজিব সহ)","৩8 জন (শেখ মুজিব সহ)","৩৫ জন (শেখ মুজিব সহ)","৩৬ জন (শেখ মুজিব সহ)"},
            {"তোফায়েল আহম্মেদ","তাজউদ্দিন আহমদ","সৈয়দ নজরুল","শেখ মুজিবুর রহমান"}

    };
    public String mCorrectAnswers[]={"বঙ্গবন্ধ শেখ মুজিবুর রহমান","তোফায়েল আহম্মেদ","রেসকোর্স ময়দানে","২৩ ফেব্রুয়ারী ১৯৬৯ সালে","৫ ফেব্রুয়ারী ১৯৬৬","১৩ ফেব্রুয়ারী ১৯৬৬","২৩ মার্চ ১৯৬৬","লাহোর প্রস্তাব","শেখ মুজিবুর রহমান","ছয়দফা","৫ ডিসেম্বর ১৯৬৯ সালে","শেখ মুজিবুর রহমান","৩ মার্চ ১৯৭১",
    "আ.স.ম. আব্দুর রব","পল্টন ময়দানে","৩ জানুয়ারী ১৯৬৮","৩৫ জন (শেখ মুজিব সহ)","শেখ মুজিবুর রহমান"};

    public String getQuestions(int a){
        String question=mQuestions[a];
        return question;
    }
    public String getChoice1(int a){
        String choice = mChoices[a][0];
        return choice;
    }
    public String getChoice2(int a){
        String choice = mChoices[a][1];
        return choice;
    }
    public String getChoice3(int a){
        String choice = mChoices[a][2];
        return choice;
    }
    public String getChoice4(int a){
        String choice = mChoices[a][3];
        return choice;
    }
    public  String getCorrectAnswer(int a){
        String answer=mCorrectAnswers[a];
        return answer;
    }
}
